---
kind: method
id: M:Autodesk.Revit.DB.Structure.ConnectionInputPointInfo.#ctor
source: html/67a8f4c0-9b01-adc7-04bd-85600761908c.htm
---
# Autodesk.Revit.DB.Structure.ConnectionInputPointInfo.#ctor Method

Construct a default input point.

## Syntax (C#)
```csharp
public ConnectionInputPointInfo()
```